Autodesk.Revit.DB.BuiltInFailures.CutterFailures.MakeCutterForSectionGStepFailed
Attempt to create or manipulate a segmented section has failed.

Autodesk.Revit.DB.BuiltInFailures.CutterFailures.MakeCutterForPlanRegionsGStepFailed
Failed to make cutter for plan view with plan regions. Try deleting one or more plan regions.

Autodesk.Revit.DB.BuiltInFailures.CutterFailures
Failures about Cutter.